Repository: Aiman003516/Mizan_Monorepo
Catalog: app_main/packages/core/core_l10n/lib/src/app_*.arb
Languages: ar

source: Settings
ar: الإعدادات

# accountTypeAsset
source: Asset
ar: أصول

# accountTypeLiability
source: Liability
ar: التزامات

# accountTypeEquity
source: Equity
ar: حقوق ملكية

# accountTypeRevenue
source: Revenue
ar: إيرادات

# accountTypeExpense
source: Expense
ar: مصروفات

source: Main Dashboard
ar: لوحة التحكم الرئيسية

source: New Sale / POS
ar: نقطة بيع / عملية جديدة

source: Reports
ar: التقارير

source: Management
ar: الإدارة

source: Accounts
ar: الحسابات

source: Products
ar: المنتجات

source: Categories
ar: التصنيفات

source: Total Amounts Report
ar: تقرير الإجماليات

source: Monthly Amounts Report
ar: تقرير الإجماليات الشهرية

source: Account Activity
ar: حركة كشف حساب

source: Manage Accounts
ar: إدارة الحسابات

source: Manage Products
ar: إدارة المنتجات

source: Manage Categories
ar: إدارة الأصناف

source: General
ar: عام

source: Clients
ar: العملاء

source: Suppliers
ar: الموردون

source: Language
ar: اللغة

source: Choose Language
ar: اختر اللغة

# noAccountsYet
source: No accounts yet. Add one!
ar: لا توجد حسابات بعد. أضف واحد!

# noResultsFound
source: No results found for "{query}".
ar: لا توجد نتائج بحث عن "{query}".

source: Type:
ar: النوع:

source: Balance:
ar: الرصيد:

source: Phone:
ar: الهاتف:

source: Error loading accounts:
ar: خطأ في تحميل الحسابات:

source: Error loading balances:
ar: خطأ في تحميل الأرصدة:

source: Add New Account
ar: إضافة حساب جديد

source: Edit Account
ar: تعديل الحساب

# accountNameHint
source: Account Name (e.g., "Cash", "Customer A")
ar: اسم الحساب (مثال: "الصندوق"، "العميل أ")

# pleaseEnterName
source: Please enter a name
ar: الرجاء إدخال اسم

source: Account Type
ar: نوع الحساب

source: Classification (Optional)
ar: التصنيف (اختياري)

source: Error loading classifications:
ar: خطأ في تحميل التصنيفات:

source: Phone Number (Optional)
ar: رقم الهاتف (اختياري)

source: Initial Balance
ar: الرصيد الافتتاحي

# pleaseEnterBalance
source: Please enter a balance (0 is okay)
ar: الرجاء إدخال رصيد (0 مقبول)

# pleaseEnterValidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صالح

source: Failed to save account:
ar: فشل حفظ الحساب:

source: Add Account
ar: إضافة حساب

# noAccountsClassified
source: No accounts classified as "{classification}" yet. Add one in the Accounts section.
ar: لا توجد حسابات مصنفة كـ "{classification}" بعد. أضف واحداً في قسم الحسابات.

source: Export to PDF
ar: تصدير إلى PDF

source: Export
ar: تصدير

source: Export to Excel
ar: تصدير إلى Excel

# excelExportSuccess
source: Excel export successfully generated.
ar: تم إنشاء ملف Excel بنجاح.

# accountBalances
source: Account Balances - {classification}
ar: أرصدة الحسابات - {classification}

source: Error loading summaries:
ar: خطأ في تحميل الملخصات:

source: Add New Transaction
ar: إضافة عملية جديدة

source: Sign In
ar: تسجيل الدخول

source: Welcome to Mizan
ar: أهلاً بك في ميزان

# signInToSync
source: Sign in to sync your data
ar: سجل الدخول لمزامنة بياناتك

source: Sign in with Google
ar: تسجيل الدخول عبر جوجل

# offlineUnavailable
source: Offline: Sync is unavailable
ar: غير متصل: المزامنة غير متاحة

source: Online
ar: متصل

source: Sync Data
ar: مزامنة البيانات

# syncNotImplemented
source: Sync not implemented yet.
ar: المزامنة لم تنفذ بعد.

source: Sign Out
ar: تسجيل الخروج

source: Search...
ar: بحث...

source: Open navigation menu
ar: فتح قائمة التنقل

source: Mizan
ar: ميزان

source: Mizan Dashboard
ar: لوحة تحكم ميزان

source: Mizan User
ar: مستخدم ميزان

source: Not Signed In
ar: لم يتم تسجيل الدخول

source: Offline Mode
ar: وضع عدم الاتصال

# syncDisabled
source: Sync is disabled
ar: المزامنة معطلة

source: Total Amounts (Summary)
ar: ملخص الإجماليات

source: Monthly Amounts (Summary)
ar: ملخص الإجماليات الشهرية

source: Account Activity / Ledger
ar: كشف حساب

source: Data Safety Warning
ar: تحذير أمان البيانات

# dataSafetyMessage
source: Your data is currently stored only on this device. To prevent data loss, please sign in to enable cloud backup.
ar: بياناتك مخزنة حالياً على هذا الجهاز فقط. لمنع فقدان البيانات، يرجى تسجيل الدخول لتمكين النسخ الاحتياطي السحابي.

source: OK
ar: موافق

source: Add New Product
ar: إضافة منتج جديد

source: Edit Product
ar: تعديل المنتج

# pleaseSelectCategory
source: Please select a category
ar: الرجاء اختيار صنف

source: Failed to save product:
ar: فشل حفظ المنتج:

# selectCategory
source: Select a Category
ar: اختر صنف

source: Error loading categories:
ar: خطأ في تحميل الأصناف:

source: Product Name
ar: اسم المنتج

source: Price
ar: السعر

# pleaseEnterPrice
source: Please enter a price
ar: الرجاء إدخال سعر

# noProductsSaved
source: No products saved. Tap "+" to add one.
ar: لا توجد منتجات محفوظة. انقر "+" لإضافة واحد.

# priceLabel
source: Price:
ar: السعر:

source: New Category
ar: صنف جديد

source: Category Name
ar: اسم الصنف

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Edit Category
ar: تعديل الصنف

# noCategoriesYet
source: No categories yet. Add one!
ar: لا توجد أصناف بعد. أضف واحد!

source: Add Category
ar: إضافة صنف

# noProductsYet
source: No products yet. Add one!
ar: لا توجد منتجات بعد. أضف واحد!

source: Error:
ar: خطأ:

source: All
ar: الكل

source: POS Sales
ar: مبيعات نقاط البيع

# noTransactionEntries
source: No transaction entries recorded for this filter.
ar: لا توجد قيود مسجلة لهذا الفلتر.

source: Date
ar: التاريخ

source: Account
ar: الحساب

source: Description
ar: الوصف

source: Debit
ar: مدين

source: Credit
ar: دائن

source: Currency
ar: العملة

# monthlyAmounts
source: Monthly Amounts - {classification}
ar: الإجماليات الشهرية - {classification}

# noMonthlyTotals
source: No monthly totals to display for this filter.
ar: لا توجد إجماليات شهرية لعرضها لهذا الفلتر.

source: Month
ar: الشهر

# currencyLabel
source: Currency:
ar: العملة:

# totalAmounts
source: Total Amounts - {classification}
ar: الإجماليات - {classification}

# noTotals
source: No totals to display for this filter.
ar: لا توجد إجماليات لعرضها لهذا الفلتر.

source: Name
ar: الاسم

source: Total Classifications
ar: إجمالي التصنيفات

# noClassificationTotals
source: No classification totals to display.
ar: لا توجد إجماليات تصنيفات لعرضها.

source: Classification
ar: التصنيف

source: Total
ar: الإجمالي

source: Upgrade to Pro
ar: الترقية إلى Pro

source: Unlock Mizan Pro
ar: افتح ميزان Pro

# proPrice
source: Get the full version for a one-time payment of
ar: احصل على النسخة الكاملة مقابل دفعة لمرة واحدة

# proFeatures
source: This includes unlimited access to all features, cloud sync, and future updates.
ar: يشمل ذلك وصولاً غير محدود لجميع الميزات، والمزامنة السحابية، والتحديثات المستقبلية.

source: Purchase Full Version
ar: شراء النسخة الكاملة

source: Could not open purchase page.
ar: تعذر فتح صفحة الشراء.

# companyProfile
source: Personal & Company Data
ar: البيانات الشخصية والشركة

# companyProfileReportHint
source: This information may be used on printed reports and invoices.
ar: هذه المعلومات قد تستخدم في التقارير والفواتير المطبوعة.

source: Company Name
ar: الاسم التجاري

# pleaseEnterCompanyName
source: Please enter a company name
ar: الرجاء إدخال اسم الشركة

source: Your Name
ar: اسمك

source: Company Address
ar: عنوان الشركة

# taxID
source: Tax ID / VAT Number
ar: الرقم الضريبي

source: Save Profile
ar: حفظ الملف الشخصي

# profileSavedSuccess
source: Profile saved successfully.
ar: تم حفظ الملف الشخصي بنجاح.

source: Failed to save profile:
ar: فشل حفظ الملف الشخصي:

source: Currency Options
ar: خيارات العملة

# noCurrenciesFound
source: No currencies found. Tap "+" to add one.
ar: لا توجد عملات. انقر "+" لإضافة واحدة.

# codeLabel
source: Code:
ar: الرمز:

source: Add New Currency
ar: إضافة عملة جديدة

# currencyCodeHint
source: Code (e.g., "EUR")
ar: الرمز (مثل "USD")

# currencyCodeHelper
source: Short, unique code (3-5 letters)
ar: رمز فريد قصير (3-5 أحرف)

# pleaseEnterCode
source: Please enter a code
ar: الرجاء إدخال رمز

# codeTooLong
source: Code is too long
ar: الرمز طويل جداً

# currencyNameHint
source: Name (e.g., "Euro")
ar: الاسم (مثل "دولار أمريكي")

# pleaseEnterCurrencyName
source: Please enter a name
ar: الرجاء إدخال اسم

# currencySymbolHint
source: Symbol (e.g., "€")
ar: الرمز

source: Failed to save:
ar: فشل الحفظ:

source: Security Options
ar: خيارات الأمان

# requirePasscode
source: Require Passcode on Entry
ar: طلب رمز الدخول عند الفتح

# toggleSecurity
source: Toggle additional security layer
ar: تفعيل طبقة أمان إضافية

source: Passcode removed.
ar: تمت إزالة رمز الدخول.

source: Set/Change Passcode
ar: تعيين/تغيير رمز الدخول

source: Not set
ar: غير معين

# useBiometrics
source: Use Biometrics to Unlock
ar: استخدام البصمة لفتح القفل

# useBiometricsHint
source: Use fingerprint, face, or iris
ar: استخدام بصمة الإصبع، الوجه، أو قزحية العين

source: Set Passcode
ar: تعيين رمز الدخول

# setPasscodeHint
source: Create a 4-digit PIN for your app. This will be required on entry.
ar: أنشئ رمز PIN من 4 أرقام لتطبيقك. سيكون مطلوباً عند الدخول.

# newPin
source: New 4-Digit PIN
ar: رمز PIN جديد (4 أرقام)

# pleaseEnterPin
source: Please enter a PIN
ar: الرجاء إدخال رمز PIN

source: PIN must be 4 digits
ar: يجب أن يتكون الرمز من 4 أرقام

# confirmPin
source: Confirm 4-Digit PIN
ar: تأكيد رمز PIN

source: PINs do not match
ar: الرمزان غير متطابقان

source: Save Passcode
ar: حفظ رمز الدخول

# passcodeSetSuccess
source: Passcode set successfully.
ar: تم تعيين رمز الدخول بنجاح.

source: Failed to save passcode:
ar: فشل حفظ رمز الدخول:

# dataAndSync
source: Data & Sync
ar: البيانات والمزامنة

# backupNow
source: Backup Data Now
ar: نسخ احتياطي للبيانات الآن

# backupHint
source: Uploads your local data to Google Drive.
ar: يرفع بياناتك المحلية إلى Google Drive.

source: Restore from Backup
ar: استعادة من نسخة احتياطية

# restoreWarning
source: CRITICAL: This will overwrite ALL current data in the app with the data from your backup file. This action cannot be undone. Are you sure?
ar: تحذير خطير: سيؤدي هذا إلى الكتابة فوق جميع البيانات الحالية في التطبيق بالبيانات من ملف النسخ الاحتياطي الخاص بك. لا يمكن التراجع عن هذا الإجراء. هل أنت متأكد؟

# buyFullVersion
source: Buy The Full Version
ar: شراء النسخة الكاملة

# restoreBackupTitle
source: Restore From File?
ar: استعادة من ملف؟

# restoreBackupMessage
source: This will overwrite all current data with the data from your selected backup file. THIS CANNOT BE UNDONE.
ar: سيؤدي هذا إلى الكتابة فوق جميع بياناتك المحلية بالبيانات من ملف النسخ الاحتياطي الذي اخترته. لا يمكن التراجع عن هذا الإجراء.

source: Restore
ar: استعادة

# restoreSuccess
source: Restore successful! Please restart Mizan to load the new data.
ar: تمت الاستعادة بنجاح! يرجى إعادة تشغيل ميزان لتحميل البيانات الجديدة.

# restoreFailed
source: Restore failed. Your original data is safe. Error: {error}
ar: فشلت الاستعادة. بياناتك الأصلية آمنة. خطأ: {error}

# featureNotImplemented
source: Feature not yet implemented.
ar: الميزة لم تنفذ بعد.

source: Choose Theme
ar: اختر المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System Default
ar: افتراضي النظام

source: Select Account
ar: اختر حساب

source: Unknown Account
ar: حساب غير معروف

# pleaseSelectCurrency
source: Please select a currency.
ar: الرجاء اختيار عملة.

# pleaseEnterAccountName
source: Please enter or select an account name.
ar: الرجاء إدخال أو اختيار اسم حساب.

# criticalAccountError
source: Critical Error: Default accounts (like Inventory) are missing.
ar: خطأ فادح: الحسابات الافتراضية (مثل المخزون) مفقودة.

# transactionSaved
source: Transaction saved successfully.
ar: تم حفظ العملية بنجاح.

# forAccount
source: For {accountName}
ar: لـ {accountName}

source: Loading...
ar: جار التحميل...

source: Account Name
ar: اسم الحساب

# pleaseEnterOrSelectAccount
source: Please enter or select an account
ar: الرجاء إدخال أو اختيار حساب

source: Amount
ar: المبلغ

# profitAndLoss
source: Profit & Loss
ar: الأرباح والخسائر

source: Revenue
ar: الإيرادات

source: Total Revenue
ar: إجمالي الإيرادات

source: Expenses
ar: المصروفات

source: Total Expenses
ar: إجمالي المصروفات

source: Net Income
ar: صافي الدخل

source: Balance Sheet
ar: الميزانية العمومية

source: As of
ar: كما في

source: Assets
ar: الأصول

source: Total Assets
ar: إجمالي الأصول

source: Liabilities
ar: الالتزامات

source: Trial Balance
ar: ميزان المراجعة

source: Total Liabilities
ar: إجمالي الالتزامات

source: Equity
ar: حقوق الملكية

source: Total Equity
ar: إجمالي حقوق الملكية

# totalLiabilitiesAndEquity
source: Total Liabilities & Equity
ar: إجمالي الالتزامات وحقوق الملكية

# pleaseEnterAmount
source: Please enter an amount
ar: الرجاء إدخال مبلغ

source: Invalid amount
ar: مبلغ غير صالح

# exchangeRate
source: Exchange Rate (1 {currencyCode} = ? {defaultCurrency})
ar: سعر الصرف (1 {currencyCode} = ؟ {defaultCurrency})

# pleaseEnterRate
source: Please enter a rate
ar: الرجاء إدخال سعر صرف

source: Invalid rate
ar: سعر صرف غير صالح

source: Add Attachment
ar: إضافة مرفق

source: Details
ar: التفاصيل

source: Could not load currencies
ar: تعذر تحميل العملات

source: Payment (Credit)
ar: دفعة (دائن)

source: Charge (Debit)
ar: عليه (مدين)

# noHistory
source: No history for this account.
ar: لا يوجد سجل عمليات لهذا الحساب.

source: Error loading history:
ar: خطأ في تحميل السجل:

# pleaseAddCategory
source: Please add a category first.
ar: الرجاء إضافة صنف أولاً.

# noProductsInCategory
source: No products in this category.
ar: لا توجد منتجات في هذا الصنف.

# quantity
source: Qty:
ar: الكمية:

source: Clear
ar: مسح

source: Print Receipt
ar: طباعة إيصال

# zeroTotalError
source: Cannot process sale with zero total.
ar: لا يمكن معالجة عملية بيع بإجمالي صفر.

# criticalSetupError
source: CRITICAL SETUP ERROR: Accounts were not created on startup. Try reinstalling.
ar: خطأ فادح في الإعداد: لم يتم إنشاء الحسابات عند بدء التشغيل. حاول إعادة التثبيت.

# posSale
source: POS Sale #{timestamp}
ar: بيع نقطة بيع #{timestamp}

# saleRecorded
source: Sale of {total} recorded.
ar: تم تسجيل عملية بيع بمبلغ {total}.

source: Transaction failed:
ar: فشلت العملية:

# noTransactionsYet
source: No transactions yet. Add one!
ar: لا توجد عمليات بعد. أضف واحدة!

# companyNameLegacy
source: Company Name
ar: الاسم التجاري

# yourNameLegacy
source: Your Name
ar: اسمك

# companyAddressLegacy
source: Company Address
ar: العنوان

# taxIDLegacy
source: Tax ID / VAT Number
ar: الرقم الضريبي

# securityOptionsLegacy
source: Security Options
ar: خيارات الأمان

source: Scan Barcode
ar: مسح الباركود

# productNotFound
source: Product not found for barcode: {barcode}
ar: المنتج غير موجود للباركود: {barcode}

source: Scan Product Barcode
ar: مسح باركود المنتج

source: Barcode (Optional)
ar: الباركود (اختياري)

source: Order Details
ar: تفاصيل الطلب

source: Cart
ar: السلة

source: Item(s)
ar: عنصر (عناصر)

source: Clear Order
ar: مسح الطلب

# printAndSave
source: Print & Save
ar: طباعة وحفظ

source: Order History
ar: سجل الطلبات

# noSalesYet
source: No POS sales have been recorded yet.
ar: لم يتم تسجيل أي مبيعات نقاط بيع بعد.

source: Return for
ar: إرجاع للطلب

# returnSuccess
source: Order returned successfully.
ar: تم إرجاع الطلب بنجاح.

# returnFailed
source: Failed to process return
ar: فشل معالجة الإرجاع

# confirmReturn
source: Return this Order?
ar: إرجاع هذا الطلب؟

# confirmReturnMessage
source: This will create a new, opposite transaction to reverse this sale. This cannot be undone.
ar: سيؤدي هذا إلى إنشاء معاملة جديدة معاكسة لإلغاء هذا البيع. لا يمكن التراجع عن هذا الإجراء.

source: Return Order
ar: إرجاع الطلب

# noItemsInSale
source: No items found for this sale (likely a direct journal entry).
ar: لم يتم العثور على أصناف في هذا البيع (ربما قيد يومية مباشر).

source: Done
ar: تم

source: Year
ar: السنة

source: Local
ar: محلي

# exchangeRateShort
source: Rate
ar: السعر

source: Upload Image
ar: تحميل صورة

source: Change Image
ar: تغيير الصورة

# removeImage
source: Remove
ar: إزالة

source: Pick From Gallery
ar: اختر من المعرض

source: Take Photo
ar: التقط صورة

source: Change
ar: تغيير

source: Remove
ar: إزالة

source: Manage Return
ar: إدارة الإرجاع

# orderFullyReturned
source: This order has been fully returned.
ar: تم إرجاع هذا الطلب بالكامل.

source: Purchased
ar: المشترى

source: Returned
ar: مُرجع

source: Return Quantity
ar: كمية الإرجاع

source: Total Refund
ar: إجمالي المبلغ المسترد

source: Process Return
ar: تنفيذ الإرجاع

# noItemsSelected
source: No items selected for return.
ar: لم يتم تحديد أي أصناف للإرجاع.

# partialReturnFor
source: Partial Return for Order {transactionId}
ar: إرجاع جزئي للطلب {transactionId}

# orderReturned
source: This order has been returned.
ar: تم إرجاع هذا الطلب.

source: Make Payment
ar: إجراء دفعة

source: Pay From Account
ar: الدفع من حساب

source: Pay To Account
ar: الدفع إلى حساب

# pleaseEnterValidAmount
source: Please enter a valid amount greater than zero
ar: الرجاء إدخال مبلغ صحيح أكبر من صفر

source: Pay
ar: ادفع

# noLineItemsSaved
source: No line items were saved for this order.
ar: لم يتم حفظ أصناف لهذا الطلب.

source: field Required
ar: الحقل مطلوب

source: select Payment Method
ar: اختر طريقة الدفع

# backupAndRestore
source: Backup & Restore
ar: النسخ الاحتياطي والاستعادة

# profitAndLossReport
source: Profit & Loss Statement
ar: قائمة الدخل

# balanceSheetReport
source: Balance Sheet
ar: الميزانية العمومية

# trialBalanceReport
source: Trial Balance
ar: ميزان المراجعة

source: Upgrade to Mizan Pro
ar: الترقية إلى ميزان برو

# mizanProDescription
source: Enable automatic cloud sync, multi-device access, and user roles. Learn more...
ar: تفعيل المزامنة السحابية، والوصول متعدد الأجهزة، وأدوار المستخدمين. اعرف المزيد...

# createLocalBackupTitle
source: Create Local Backup?
ar: إنشاء نسخة احتياطية محلية؟

# createLocalBackupMessage
source: This will save a copy of your database to a location you choose (e.g., Downloads, Google Drive).
ar: سيؤدي هذا إلى حفظ نسخة من قاعدة بياناتك في موقع تختاره (مثل التنزيلات، جوجل درايف).

source: Yes
ar: نعم

# newPurchase
source: New Purchase / Bill
ar: فاتورة مشتريات جديدة

# purchaseScreenTitle
source: New Purchase / Bill
ar: فاتورة شراء جديدة

# selectSupplier
source: Select a Supplier
ar: اختر المورد

source: Supplier
ar: المورد

# pleaseSelectSupplier
source: Please select a supplier
ar: الرجاء اختيار مورد.

source: Add Product
ar: أضف منتج

source: Product
ar: المنتج

# quantityShort
source: Qty
ar: الكمية

source: Cost
ar: التكلفة

source: Total Cost
ar: التكلفة الإجمالية

source: Cost per item
ar: التكلفة

source: total Payable
ar: مجموع المدفوع

# pleaseEnterCost
source: Please enter a cost
ar: الرجاء إدخال التكلفة

# pleaseEnterQuantity
source: Please enter a quantity
ar: الرجاء إدخال الكمية

# purchaseSaved
source: Purchase saved successfully.
ar: تم حفظ فاتورة الشراء بنجاح.

# failedToSavePurchase
source: Failed to save purchase: {error}
ar: فشل حفظ فاتورة الشراء: {error}

# purchaseFrom
source: Purchase from {supplierName}
ar: شراء من {supplierName}

# createLocalBackupPrompt
source: This will create a local backup file (mizan.db) in a folder you choose. You can use this file to restore your data on this or another device.
ar: سيؤدي هذا إلى إنشاء ملف نسخ احتياطي محلي (mizan.db) في مجلد تختاره. يمكنك استخدام هذا الملف لاستعادة بياناتك على هذا الجهاز أو جهاز آخر.

source: Backup
ar: نسخ احتياطي

# backupSuccessful
source: Backup successful! File saved to: {path}
ar: تم النسخ الاحتياطي

# backupFailed
source: Backup failed: {error}
ar: فشل النسخ الاحتياطي

source: Restore Successful
ar: نجحت الاستعادة

# restoreSuccessMessage
source: Your data has been restored. Please restart the app now.
ar: تمت استعادة بياناتك. يرجى إعادة تشغيل التطبيق الآن.

source: Learn More
ar: اعرف المزيد

source: Dashboard
ar: لوحة التحكم

source: New Sale
ar: عملية بيع جديدة

source: Total Receivable
ar: إجمالي المستحقات

# saveSuccessPrintFailed
source: Save success, but print failed: {error}
ar: نجح الحفظ، لكن فشلت الطباعة: {error}

# errorLoadingPaymentMethods
source: Error loading payment methods: {error}
ar: خطأ في تحميل طرق الدفع: {error}

# dbFileNotFound
source: Database file not found.
ar: ملف قاعدة البيانات غير موجود.

# noBackupFound
source: No backup file found on Google Drive.
ar: لم يتم العثور على ملف نسخ احتياطي على Google Drive.

source: Mizan Accounting
ar: ميزان للمحاسبة

# generatedOn
source: Generated on: {date}
ar: تم إنشاؤه في: {date}

source: Total (Local)
ar: الإجمالي (محلي)

# couldNotLaunch
source: Could not launch {url}
ar: تعذر فتح {url}

# webNotSupported
source: Web platform is not supported
ar: منصة الويب غير مدعومة

# signInCancelled
source: Sign-in cancelled by user.
ar: تم إلغاء تسجيل الدخول من قبل المستخدم.

# updateWindowsClientId
source: Please update the Windows Client ID in auth_repository.dart
ar: يرجى تحديث Client ID الخاص بويندوز في auth_repository.dart

# updateWindowsClientIdSecret
source: Please update Windows Client ID/Secret in auth_repository.dart
ar: يرجى تحديث Client ID/Secret الخاص بويندوز في auth_repository.dart

# authFailed
source: Authentication failed. Unable to get HTTP client.
ar: فشلت المصادقة. تعذر الحصول على عميل HTTP.

# criticalInventoryError
source: Critical Error: Inventory or COGS accounts not found.
ar: خطأ فادح: حسابات المخزون أو تكلفة البضاعة المباعة غير موجودة.

# drLabel
source: Dr:
ar: مدين:

# crLabel
source: Cr:
ar: دائن:
